struct drawSurf_t
{
    unsigned long long sortValue; // Offset: 0x0

    unsigned long long modelIndex; // Offset: 0x0

    unsigned long long surfaceAllocationOffset; // Offset: 0x0

    unsigned long long modelSurfaceIndex; // Offset: 0x0

    unsigned long long materialPass; // Offset: 0x0

    unsigned long long skinningMode; // Offset: 0x0

    unsigned long long viewModelIndex; // Offset: 0x0

    unsigned long long testOcclusion; // Offset: 0x0

    unsigned long long geoDecalProjOffset; // Offset: 0x0

    unsigned long long startGeometry; // Offset: 0x0

    unsigned long long numGeometries; // Offset: 0x0

    unsigned long long renderLod; // Offset: 0x0

}; // Size: 0x20
