struct idContents
{
    // CONTENTS_SOLID
    bool solid; // Offset: 0x0

    // CONTENTS_OPAQUE
    bool opaque; // Offset: 0x0

    // CONTENTS_WATER
    bool water; // Offset: 0x0

    // CONTENTS_PLAYERCLIP
    bool playerClip; // Offset: 0x0

    // CONTENTS_MONSTERCLIP
    bool monsterClip; // Offset: 0x0

    // CONTENTS_DEMONPLAYERCLIP
    bool demonPlayerClip; // Offset: 0x0

    // CONTENTS_MOVEABLECLIP
    bool moveableClip; // Offset: 0x0

    // CONTENTS_SHOTCLIP
    bool shotClip; // Offset: 0x0

    // CONTENTS_IKCLIP
    bool ikClip; // Offset: 0x0

    // CONTENTS_AIAWARE
    bool aiAware; // Offset: 0x0

    // CONTENTS_AI
    bool ai; // Offset: 0x0

    // CONTENTS_PROJECTILE
    bool projectile; // Offset: 0x0

    // CONTENTS_CORPSE
    bool corpse; // Offset: 0x0

    // CONTENTS_TRIGGER
    bool trigger; // Offset: 0x0

    // CONTENTS_PLAYER
    bool player; // Offset: 0x0

    // CONTENTS_TEAM_ONE
    bool team_one; // Offset: 0x0

    // CONTENTS_OBSTACLE
    bool obstacle; // Offset: 0x0

    // CONTENTS_TEAM_TWO
    bool team_two; // Offset: 0x0

    // CONTENTS_PLAYERCOVERCLIP
    bool playerCoverClip; // Offset: 0x0

    // CONTENTS_SOLIDPUSHABLE_PUSHABLE
    bool solidPushable; // Offset: 0x0

    // CONTENTS_PLAYERFOCUS
    bool playerFocus; // Offset: 0x0

    // CONTENTS_PUSHABLE
    bool pushable; // Offset: 0x0

    // CONTENTS_NO_TELEPORT
    bool noTeleport; // Offset: 0x0

    // CONTENTS_WALL_GRAB_CLIP
    bool wallGrabClip; // Offset: 0x0

    // CONTENTS_BREAKABLE
    bool breakable; // Offset: 0x0

    // The AAS flags probably should never be exposed to the editor  __edit boolaasFly: 1; CONTENTS_AAS_FLY __edit boolaasSolid: 1; CONTENTS_AAS_SOLID __edit boolaasObstacle: 1; CONTENTS_AAS_OBSTACLE __edit boolaasClusterPortal: 1; CONTENTS_AAS_CLUSTER_PORTAL __edit boolaasWalkableWall: 1; CONTENTS_AAS_WALKABLE_WALL CONTENTS_EMPTY
    bool empty; // Offset: 0x0

}; // Size: 0x4
