struct idDeclCustomization : idDeclTypeInfo
{
    // Helmet mask
    idMaterial2* playerHelmetMat; // Offset: 0x88

    // Torso mask
    idMaterial2* playerTorsoMat; // Offset: 0x90

    // Left Arm mask
    idMaterial2* playerLeftArmMat; // Offset: 0x98

    // Right Arm mask
    idMaterial2* playerRightArmMat; // Offset: 0xA0

    // Left Leg mask
    idMaterial2* playerLeftLegMat; // Offset: 0xA8

    // Right Leg mask
    idMaterial2* playerRightLegMat; // Offset: 0xB0

    // Weapon 1 - 1st mask
    idMaterial2* playerWeapon1Mat1; // Offset: 0xB8

    // Weapon 1 - 2nd mask
    idMaterial2* playerWeapon1Mat2; // Offset: 0xC0

    // Weapon 1 - 3rd mask
    idMaterial2* playerWeapon1Mat3; // Offset: 0xC8

    // Weapon 2 - 1st mask
    idMaterial2* playerWeapon2Mat1; // Offset: 0xD0

    // Weapon 2 - 2nd mask
    idMaterial2* playerWeapon2Mat2; // Offset: 0xD8

    // Weapon 2 - 3rd mask
    idMaterial2* playerWeapon2Mat3; // Offset: 0xE0

}; // Size: 0xE8
