struct idDeclAIMasterGraphNode : idTypeInfoGraphNode
{
    // KEEP THESE ALPHABETIZEDadfads
    idDeclAmmo* ammo; // Offset: 0x30

    // dfasd
    idDeclDamage* damage; // Offset: 0x38

    // dfasd
    idDeclDamage* damageSplash; // Offset: 0x40

    // dadfadf
    idDeclExplosion* explosionDecl; // Offset: 0x48

    // dfadf
    idDeclProjectile* projectile; // Offset: 0x50

    // adfdas
    idDeclEntityDef* projectileEntity; // Offset: 0x58

    // aaaaa
    idDeclStatusEffect* statusEffectDecl; // Offset: 0x60

    // adfadf
    idDeclWeapon* weapon; // Offset: 0x68

    // adfadf
    idDeclEntityDef* weaponEntity; // Offset: 0x70

}; // Size: 0x78
