struct idHUD_DemonAbilityBar_Side : idHUDElement
{
    idSWFWidget_DemonAbility* ability_quickUse1; // Offset: 0xF8

    idSWFWidget_DemonAbility* ability_quickUse2; // Offset: 0x100

    idSWFWidget_DemonAbility* ability_quickUse3; // Offset: 0x108

    idSWFWidget_DemonAbility* ability_quickUse4; // Offset: 0x110

    idSWFWidget_DemonAbility* ability_invasion; // Offset: 0x118

    bool isGhost; // Offset: 0x120

    bool isDisguised; // Offset: 0x121

    bool isDisguiseDestructible; // Offset: 0x122

    bool isChatIndicatorVisible; // Offset: 0x123

}; // Size: 0x128
