struct idNavGenSettings
{
    bool mesh_simplify; // Offset: 0x0

    float mesh_characterHeight; // Offset: 0x4

    float mesh_characterWidth; // Offset: 0x8

    float mesh_maxBorderError; // Offset: 0xC

    float mesh_maxHeightError; // Offset: 0x10

    float volume_characterHeight; // Offset: 0x14

    float volume_characterDepth; // Offset: 0x18

    float volume_characterRadius; // Offset: 0x1C

    float volume_minCellWidth; // Offset: 0x20

    float volume_minRegionVolume; // Offset: 0x24

    idStr groupName; // Offset: 0x28

    idStr groupSizeName; // Offset: 0x58

}; // Size: 0x88
