struct idSWFWidget_AccessibilitySettings : idSWFWidget
{
    idSettingsDataSource_Accessibility dataSource; // Offset: 0x180

    idSWFWidget_SettingsList* settingsList; // Offset: 0x1F8

    idMainMenu_Screen_Settings* settingsMenu; // Offset: 0x200

    // GAME
    idSWFWidget_Setting* screenShake; // Offset: 0x208

    idSWFWidget_Setting* sentinelArmor; // Offset: 0x210

    idSWFWidget_Setting* gameHints; // Offset: 0x218

    idSWFWidget_Setting* showTutorials; // Offset: 0x220

    idSWFWidget_Setting* autoWallClimb; // Offset: 0x228

    idSWFWidget_Setting* autoWallBreak; // Offset: 0x230

    idSWFWidget_Setting* autoGKWhenDashing; // Offset: 0x238

    idSWFWidget_Setting* autoSkipCutscene; // Offset: 0x240

    idSWFWidget_Setting* autoAttack; // Offset: 0x248

    idSWFWidget_Setting* autoCompletePuzzles; // Offset: 0x250

    idSWFWidget_Setting* puzzleTiming; // Offset: 0x258

    idSWFWidget_Setting* gameSpeed; // Offset: 0x260

    idSWFWidget_Setting* matchWithAccessibility; // Offset: 0x268

    idSWFWidget_Setting* weaponBob; // Offset: 0x270

    idSWFWidget_Setting* showAITypeIcons; // Offset: 0x278

    // UI
    idSWFWidget_Setting* uiColorBlindMode; // Offset: 0x280

    idSWFWidget_Setting* hudColor; // Offset: 0x288

    // CONTROLS
    idSWFWidget_Setting* aimAssist; // Offset: 0x290

    idSWFWidget_Setting* aimAssistScaling; // Offset: 0x298

    idSWFWidget_Setting* aimAssistTargetSnap; // Offset: 0x2A0

    idSWFWidget_Setting* multipleControlDevices; // Offset: 0x2A8

    idSWFWidget_Setting* holdToggleModActivation; // Offset: 0x2B0

    // VIDEO
    idSWFWidget_Setting* pseFilter; // Offset: 0x2B8

    idSWFWidget_Setting* pseLumDeltaThreshold; // Offset: 0x2C0

    idSWFWidget_Setting* pseFullscreenLumDeltaThreshold; // Offset: 0x2C8

    idSWFWidget_Setting* videoColorBlindMode; // Offset: 0x2D0

    idSWFWidget_Setting* colorblindBrightness; // Offset: 0x2D8

    idSWFWidget_Setting* colorblindContrast; // Offset: 0x2E0

    idSWFWidget_Setting* colorblindIntensity; // Offset: 0x2E8

    idSWFWidget_Setting* colorblindCorrectionStrength; // Offset: 0x2F0

    idSWFWidget_Setting* motionBlur; // Offset: 0x2F8

    idSWFWidget_Setting* motionBlurToggle; // Offset: 0x300

    idSWFWidget_Setting* reducedBGMode; // Offset: 0x308

    // AUDIO
    idSWFWidget_Setting* subtitleDisplay; // Offset: 0x310

    idSWFWidget_Setting* closedCaptioning; // Offset: 0x318

    idSWFWidget_Setting* subtitleSpeakerName; // Offset: 0x320

    idSWFWidget_Setting* subtitleBackground; // Offset: 0x328

    idSWFWidget_Setting* subtitleSize; // Offset: 0x330

    // CHAT
    idSWFWidget_Setting* chatIncomingTextToSpeechEnabled; // Offset: 0x338

    idSWFWidget_Setting* chatOutgoingTextToSpeechEnabled; // Offset: 0x340

    idSWFWidget_Setting* chatSpeechToTextEnabled; // Offset: 0x348

    idSWFWidget_Setting* chatTranslationEnabled; // Offset: 0x350

    idSWFWidget_Setting* chatSpeechProfile; // Offset: 0x358

}; // Size: 0x360
