struct idSWFScriptObject_SpriteInstancePrototype : idSWFScriptObject
{
    struct idSWFScriptFunction_duplicateMovieClip : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_gotoAndPlay : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_gotoAndStop : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_swfWait : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_swfTriggeredPause : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_swapDepths : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_nextFrame : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_prevFrame : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_play : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_stop : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_toString : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_tween : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_removeTweens : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_addFrameScript : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_showBink : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_showMaterial : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_tweenNamedColors : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_setSpriteFlags : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_addSpriteFlags : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptNativeVar_z : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_x : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_y : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_scaleX : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_scaleY : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_alpha : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_brightness : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_visible : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_width : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_height : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_rotation : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_name : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_parent : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_currentFrame : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_totalFrames : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_framesLoaded : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_mouseX : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_mouseY : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_material : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_materialWidth : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_materialHeight : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_offsetX : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_onEnterFrame : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_swfColor : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_walkthroughID : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__z : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__x : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__y : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__xscale : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__yscale : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__alpha : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__visible : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__width : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__height : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__rotation : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__name : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__currentframe : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__totalframes : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__framesloaded : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__xmouse : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__ymouse : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__xOffset : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_duplicateMovieClip scriptFunction_duplicateMovieClip; // Offset: 0xC0

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_gotoAndPlay scriptFunction_gotoAndPlay; // Offset: 0x180

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_gotoAndStop scriptFunction_gotoAndStop; // Offset: 0x240

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_swfWait scriptFunction_swfWait; // Offset: 0x300

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_swfTriggeredPause scriptFunction_swfTriggeredPause; // Offset: 0x3C0

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_swapDepths scriptFunction_swapDepths; // Offset: 0x480

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_nextFrame scriptFunction_nextFrame; // Offset: 0x540

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_prevFrame scriptFunction_prevFrame; // Offset: 0x600

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_play scriptFunction_play; // Offset: 0x6C0

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_stop scriptFunction_stop; // Offset: 0x780

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_toString scriptFunction_toString; // Offset: 0x840

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_tween scriptFunction_tween; // Offset: 0x900

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_removeTweens scriptFunction_removeTweens; // Offset: 0x9C0

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_addFrameScript scriptFunction_addFrameScript; // Offset: 0xA80

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_showBink scriptFunction_showBink; // Offset: 0xB40

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_showMaterial scriptFunction_showMaterial; // Offset: 0xC00

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_tweenNamedColors scriptFunction_tweenNamedColors; // Offset: 0xCC0

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_setSpriteFlags scriptFunction_setSpriteFlags; // Offset: 0xD80

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptFunction_addSpriteFlags scriptFunction_addSpriteFlags; // Offset: 0xE40

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_z swfScriptVar_z; // Offset: 0xF00

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_x swfScriptVar_x; // Offset: 0xF08

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_y swfScriptVar_y; // Offset: 0xF10

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_scaleX swfScriptVar_scaleX; // Offset: 0xF18

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_scaleY swfScriptVar_scaleY; // Offset: 0xF20

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_alpha swfScriptVar_alpha; // Offset: 0xF28

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_brightness swfScriptVar_brightness; // Offset: 0xF30

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_visible swfScriptVar_visible; // Offset: 0xF38

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_width swfScriptVar_width; // Offset: 0xF40

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_height swfScriptVar_height; // Offset: 0xF48

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_rotation swfScriptVar_rotation; // Offset: 0xF50

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_name swfScriptVar_name; // Offset: 0xF58

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_parent swfScriptVar_parent; // Offset: 0xF60

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_currentFrame swfScriptVar_currentFrame; // Offset: 0xF68

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_totalFrames swfScriptVar_totalFrames; // Offset: 0xF70

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_framesLoaded swfScriptVar_framesLoaded; // Offset: 0xF78

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_mouseX swfScriptVar_mouseX; // Offset: 0xF80

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_mouseY swfScriptVar_mouseY; // Offset: 0xF88

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_material swfScriptVar_material; // Offset: 0xF90

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_materialWidth swfScriptVar_materialWidth; // Offset: 0xF98

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_materialHeight swfScriptVar_materialHeight; // Offset: 0xFA0

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_offsetX swfScriptVar_offsetX; // Offset: 0xFA8

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_onEnterFrame swfScriptVar_onEnterFrame; // Offset: 0xFB0

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_swfColor swfScriptVar_swfColor; // Offset: 0xFB8

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar_walkthroughID swfScriptVar_walkthroughID; // Offset: 0xFC0

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__z swfScriptVar__z; // Offset: 0xFC8

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__x swfScriptVar__x; // Offset: 0xFD0

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__y swfScriptVar__y; // Offset: 0xFD8

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__xscale swfScriptVar__xscale; // Offset: 0xFE0

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__yscale swfScriptVar__yscale; // Offset: 0xFE8

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__alpha swfScriptVar__alpha; // Offset: 0xFF0

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__visible swfScriptVar__visible; // Offset: 0xFF8

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__width swfScriptVar__width; // Offset: 0x1000

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__height swfScriptVar__height; // Offset: 0x1008

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__rotation swfScriptVar__rotation; // Offset: 0x1010

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__name swfScriptVar__name; // Offset: 0x1018

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__currentframe swfScriptVar__currentframe; // Offset: 0x1020

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__totalframes swfScriptVar__totalframes; // Offset: 0x1028

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__framesloaded swfScriptVar__framesloaded; // Offset: 0x1030

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__xmouse swfScriptVar__xmouse; // Offset: 0x1038

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__ymouse swfScriptVar__ymouse; // Offset: 0x1040

    idSWFScriptObject_SpriteInstancePrototype::idSWFScriptNativeVar__xOffset swfScriptVar__xOffset; // Offset: 0x1048

}; // Size: 0x1050
