struct idSWFWidget_WheelWedgeData
{
    idMaterial2* icon; // Offset: 0x0

    swfNamedColors_t color; // Offset: 0x8

    float charge; // Offset: 0xC

    float cooldown; // Offset: 0x10

    int uses; // Offset: 0x14

    idStrId name; // Offset: 0x18

    idStrId desc; // Offset: 0x1C

    bool disabled; // Offset: 0x20

}; // Size: 0x28
