struct idSWFWidget_FixedList : idSWFWidget
{
    bool allowWrapping; // Offset: 0x180

    bool childrenUseCustomSpritePath; // Offset: 0x181

    bool defaultSpritePathIncludesInfo; // Offset: 0x182

    bool lockControls; // Offset: 0x183

    bool useListData; // Offset: 0x184

    bool useAllListData; // Offset: 0x185

    bool selectOnRollOver; // Offset: 0x186

    bool resetStartY; // Offset: 0x187

    bool resetFocusOnScreenChange; // Offset: 0x188

    bool playScrollFailedSound; // Offset: 0x189

    bool updateStateOfChildrenOnUpdate; // Offset: 0x18A

    bool scrollFailPassthrough; // Offset: 0x18B

    bool updateParentOnScroll; // Offset: 0x18C

}; // Size: 0x190
