struct idSWFScriptObject_TextInstancePrototype : idSWFScriptObject
{
    struct idSWFScriptFunction_onKey : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_onChar : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_generateRnd : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_calcNumLines : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptFunction_toString : idSWFScriptFunction_Nested
    {
    }; // Size: 0xC0

    struct idSWFScriptNativeVar_fontFX : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_fontId : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_text : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_autoSize : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_variable : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_alpha : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__alpha : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_textColor : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_visible : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__visible : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_scroll : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_maxscroll : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_selectionStart : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_selectionEnd : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_isTooltip : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_tooltipShowsOnlyFirstBind : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_tooltipBindset : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_mode : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_delay : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_renderSound : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_updateScroll : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__fontFXMaterialIndex : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar__textLength : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    struct idSWFScriptNativeVar_parent : idSWFScriptNativeVariable
    {
    }; // Size: 0x8

    idSWFScriptObject_TextInstancePrototype::idSWFScriptFunction_onKey scriptFunction_onKey; // Offset: 0xC0

    idSWFScriptObject_TextInstancePrototype::idSWFScriptFunction_onChar scriptFunction_onChar; // Offset: 0x180

    idSWFScriptObject_TextInstancePrototype::idSWFScriptFunction_generateRnd scriptFunction_generateRnd; // Offset: 0x240

    idSWFScriptObject_TextInstancePrototype::idSWFScriptFunction_calcNumLines scriptFunction_calcNumLines; // Offset: 0x300

    idSWFScriptObject_TextInstancePrototype::idSWFScriptFunction_toString scriptFunction_toString; // Offset: 0x3C0

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_fontFX swfScriptVar_fontFX; // Offset: 0x480

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_fontId swfScriptVar_fontId; // Offset: 0x488

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_text swfScriptVar_text; // Offset: 0x490

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_autoSize swfScriptVar_autoSize; // Offset: 0x498

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_variable swfScriptVar_variable; // Offset: 0x4A0

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_alpha swfScriptVar_alpha; // Offset: 0x4A8

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar__alpha swfScriptVar__alpha; // Offset: 0x4B0

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_textColor swfScriptVar_textColor; // Offset: 0x4B8

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_visible swfScriptVar_visible; // Offset: 0x4C0

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar__visible swfScriptVar__visible; // Offset: 0x4C8

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_scroll swfScriptVar_scroll; // Offset: 0x4D0

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_maxscroll swfScriptVar_maxscroll; // Offset: 0x4D8

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_selectionStart swfScriptVar_selectionStart; // Offset: 0x4E0

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_selectionEnd swfScriptVar_selectionEnd; // Offset: 0x4E8

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_isTooltip swfScriptVar_isTooltip; // Offset: 0x4F0

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_tooltipShowsOnlyFirstBind swfScriptVar_tooltipShowsOnlyFirstBind; // Offset: 0x4F8

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_tooltipBindset swfScriptVar_tooltipBindset; // Offset: 0x500

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_mode swfScriptVar_mode; // Offset: 0x508

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_delay swfScriptVar_delay; // Offset: 0x510

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_renderSound swfScriptVar_renderSound; // Offset: 0x518

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_updateScroll swfScriptVar_updateScroll; // Offset: 0x520

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar__fontFXMaterialIndex swfScriptVar__fontFXMaterialIndex; // Offset: 0x528

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar__textLength swfScriptVar__textLength; // Offset: 0x530

    idSWFScriptObject_TextInstancePrototype::idSWFScriptNativeVar_parent swfScriptVar_parent; // Offset: 0x538

}; // Size: 0x540
