struct idSWFWidget_HordeSummary_finalScoreDisplay : idSWFWidget
{
    idDeclHordeSummaryUtility* hordeUtilityDecl; // Offset: 0x180

    idSWFCachedSpriteInstance scoreText; // Offset: 0x188

    idSWFCachedSpriteInstance medalText; // Offset: 0x1B8

    idSWFCachedSpriteInstance pointsToNextText; // Offset: 0x1E8

    idSWFCachedSpriteInstance medalGlow; // Offset: 0x218

    idSWFCachedSpriteInstance scoreGlow; // Offset: 0x248

    idSWFCachedSpriteInstance medalHex; // Offset: 0x278

    idSWFCachedSpriteInstance nextMedal; // Offset: 0x2A8

    idSWFCachedSpriteInstance currentMedal; // Offset: 0x2D8

}; // Size: 0x308
