struct idSWFWidget_UISettings : idSWFWidget
{
    idSettingsDataSource_UI dataSource; // Offset: 0x180

    idSWFWidget_SettingsList* settingsList; // Offset: 0x210

    // UI
    idSWFWidget_Setting* uiColorProfile; // Offset: 0x218

    idSWFWidget_Setting* confirmationTime; // Offset: 0x220

    // HUD
    idSWFWidget_Setting* hudMode; // Offset: 0x228

    idSWFWidget_Setting* hudScale; // Offset: 0x230

    idSWFWidget_Setting* hudOpacity; // Offset: 0x238

    idSWFWidget_Setting* crosshairStyle; // Offset: 0x240

    idSWFWidget_Setting* hudCompass; // Offset: 0x248

    idSWFWidget_Setting* hudKeycard; // Offset: 0x250

    idSWFWidget_Setting* hudInteractPrompt; // Offset: 0x258

    idSWFWidget_Setting* hudBossHealth; // Offset: 0x260

    idSWFWidget_Setting* hudObjectiveMarkers; // Offset: 0x268

    idSWFWidget_Setting* hudCombatRating; // Offset: 0x270

    idSWFWidget_Setting* hudHordeScore; // Offset: 0x278

    idSWFWidget_Setting* hudBloodPunch; // Offset: 0x280

    idSWFWidget_Setting* hudRunes; // Offset: 0x288

    idSWFWidget_Setting* hudDash; // Offset: 0x290

    idSWFWidget_Setting* hudWeaponInfo; // Offset: 0x298

    idSWFWidget_Setting* hudHealthInfo; // Offset: 0x2A0

    idSWFWidget_Setting* hudEquipmentInfo; // Offset: 0x2A8

    idSWFWidget_Setting* hudPowerup; // Offset: 0x2B0

    idSWFWidget_Setting* hudExtraLives; // Offset: 0x2B8

    idSWFWidget_Setting* hudTextChat; // Offset: 0x2C0

    idSWFWidget_Setting* hudAbilityIndicatorType; // Offset: 0x2C8

    idSWFWidget_Setting* hudAbilityIndicatorBloodPunch; // Offset: 0x2D0

    idSWFWidget_Setting* hudAbilityIndicatorHammer; // Offset: 0x2D8

    idSWFWidget_Setting* hudAbilityIndicatorChainsaw; // Offset: 0x2E0

    idSWFWidget_Setting* hudAbilityIndicatorFlameBelch; // Offset: 0x2E8

    idSWFWidget_Setting* hudAbilityIndicatorGrenade; // Offset: 0x2F0

    idSWFWidget_Setting* hudAbilityIndicatorIceGrenade; // Offset: 0x2F8

    // NOTIFICATIONS
    idSWFWidget_Setting* hudPresets; // Offset: 0x300

    idSWFWidget_Setting* notificationMajor; // Offset: 0x308

    idSWFWidget_Setting* notificationMinor; // Offset: 0x310

    idSWFWidget_Setting* notificationMenu; // Offset: 0x318

    idSWFWidget_Setting* hudNotifications; // Offset: 0x320

    idSWFWidget_Setting* notificationAmmoPickup; // Offset: 0x328

    idSWFWidget_Setting* notificationHealthPickup; // Offset: 0x330

    idSWFWidget_Setting* notificationLevelUp; // Offset: 0x338

    idSWFWidget_Setting* notificationMissionChallenges; // Offset: 0x340

    idSWFWidget_Setting* notificationSpeaker; // Offset: 0x348

    // ACCESSIBILITY
    idSWFWidget_Setting* uiColorBlindMode; // Offset: 0x350

    idSWFWidget_Setting* hudColor; // Offset: 0x358

}; // Size: 0x360
