struct idSWFWidget_ControlsSettings : idSWFWidget
{
    idSettingsDataSource_Controls dataSource; // Offset: 0x180

    idSWFWidget_SettingsList* settingsList; // Offset: 0x1C0

    idSWFWidget_Setting* horizSensitivity; // Offset: 0x1C8

    idSWFWidget_Setting* vertSensitivity; // Offset: 0x1D0

    idSWFWidget_Setting* mouseSensitivity; // Offset: 0x1D8

    idSWFWidget_Setting* enableController; // Offset: 0x1E0

    idSWFWidget_Setting* weaponWheelHoldTime; // Offset: 0x1E8

    idSWFWidget_Setting* invertLookMouse; // Offset: 0x1F0

    idSWFWidget_Setting* invertLookController; // Offset: 0x1F8

    idSWFWidget_Setting* vibrate; // Offset: 0x200

    idSWFWidget_Setting* vibrationScale; // Offset: 0x208

    idSWFWidget_Setting* hapticsEnabled; // Offset: 0x210

    idSWFWidget_Setting* hapticVibration; // Offset: 0x218

    idSWFWidget_Setting* hapticResistance; // Offset: 0x220

    idSWFWidget_Setting* lookSmoothing; // Offset: 0x228

    idSWFWidget_Setting* aimAssist; // Offset: 0x230

    idSWFWidget_Setting* controllerLayoutsSlayer; // Offset: 0x238

    idSWFWidget_Setting* controllerLayoutsDemon; // Offset: 0x240

    idSWFWidget_Setting* keyBindingsSlayer; // Offset: 0x248

    idSWFWidget_Setting* keyBindingsDemon; // Offset: 0x250

    idSWFWidget_Setting* mouseXSensitivity; // Offset: 0x258

    idSWFWidget_Setting* mouseYSensitivity; // Offset: 0x260

    idSWFWidget_Setting* razerChroma; // Offset: 0x268

    idSWFWidget_Setting* aimAssistScaling; // Offset: 0x270

    idSWFWidget_Setting* aimAssistTargetSnap; // Offset: 0x278

    idSWFWidget_Setting* gyroAiming; // Offset: 0x280

    idSWFWidget_Setting* gyroXSensitivity; // Offset: 0x288

    idSWFWidget_Setting* gyroYSensitivity; // Offset: 0x290

    idSWFWidget_Setting* multipleControlDevices; // Offset: 0x298

    idSWFWidget_Setting* holdToggleModActivation; // Offset: 0x2A0

    int slayerLayoutsCmdID; // Offset: 0x2A8

    int demonLayoutsCmdID; // Offset: 0x2AC

    int slayerBindingsCmdID; // Offset: 0x2B0

    int demonBindingsCmdID; // Offset: 0x2B4

}; // Size: 0x2B8
