struct matchSummaryScreenData_t
{
    int summaryTabCount; // Offset: 0x0

    int statsTabCount; // Offset: 0x4

    int rankTabCount; // Offset: 0x8

    int rewardsTabCount; // Offset: 0xC

    int summaryDuration_s; // Offset: 0x10

    int statsDuration_s; // Offset: 0x14

    int rankDuration_s; // Offset: 0x18

    int rewardsDuration_s; // Offset: 0x1C

    int cummulativeDuration_s; // Offset: 0x20

}; // Size: 0x24
