struct playerRankColors_t
{
    // Base color to use for backgrounds, etc.
    swfNamedColors_t base; // Offset: 0x0

    // Display name text color
    swfNamedColors_t displayName; // Offset: 0x4

    // Description text color
    swfNamedColors_t description; // Offset: 0x8

    // Progress bar border color
    swfNamedColors_t progressBorder; // Offset: 0xC

    // Progress bar fill color
    swfNamedColors_t progressFill; // Offset: 0x10

    // Progress text color
    swfNamedColors_t progressText; // Offset: 0x14

    // Scroll bar arrow color
    swfNamedColors_t scrollBarArrow; // Offset: 0x18

    // Scroll bar button color
    swfNamedColors_t scrollBarButton; // Offset: 0x1C

    // Scroll bar track color
    swfNamedColors_t scrollBarTrack; // Offset: 0x20

}; // Size: 0x24
