struct playerAnimAbilities_t
{
    // can the player change weapons?
    bool canChangeWeapon; // Offset: 0x0

    // can the player change ammo?
    bool canChangeAmmo; // Offset: 0x0

    // can the player reload?
    bool canReload; // Offset: 0x0

    // can the player zoom?
    bool canZoom; // Offset: 0x0

    // can the player throw?
    bool canThrow; // Offset: 0x0

    // can the player quick use an item?
    bool canQuickUse; // Offset: 0x0

    // can the player use the cover lean system?
    bool canCoverLean; // Offset: 0x0

    // can the player melee?
    bool canMelee; // Offset: 0x0

    // can the player shoot a weapon?
    bool canShoot; // Offset: 0x0

    // can the player jump?
    bool canJump; // Offset: 0x0

    // can the player crouch?
    bool canCrouch; // Offset: 0x0

    // can the player dash?
    bool canDash; // Offset: 0x0

}; // Size: 0x2
