struct socialScreenData_t
{
    int friendsCumDuration; // Offset: 0x0

    int recentPlayersCumDuration; // Offset: 0x4

    int partyCumDuration; // Offset: 0x8

    int favoritesCumDuration; // Offset: 0xC

    int friendsCountVisits; // Offset: 0x10

    int recentPlayersCountVisits; // Offset: 0x14

    int partyCountVisits; // Offset: 0x18

    int favoritesCountVisits; // Offset: 0x1C

    int totalScreenTime; // Offset: 0x20

}; // Size: 0x24
