struct videoQualityPresets_t
{
    int directionalOcclusionQuality; // Offset: 0x0

    int motionBlurQuality; // Offset: 0x4

    int texturePoolSizeQuality; // Offset: 0x8

    int shadowsQuality; // Offset: 0xC

    int reflectionsQuality; // Offset: 0x10

    int lightsQuality; // Offset: 0x14

    int decalQuality; // Offset: 0x18

    int particlesQuality; // Offset: 0x1C

    int waterQuality; // Offset: 0x20

    int volumetricsQuality; // Offset: 0x24

    int textureFilteringQuality; // Offset: 0x28

    int geometricQuality; // Offset: 0x2C

    int dlssQuality; // Offset: 0x30

    float dlssSharpness; // Offset: 0x34

    int amdFsrQuality; // Offset: 0x38

    float amdFsrSharpness; // Offset: 0x3C

}; // Size: 0x40
