struct weaponSkinSet_t
{
    // Skin to apply to BFG
    idDeclWarehouseItem* bfgSkin; // Offset: 0x0

    // Skin to apply to chainsaw
    idDeclWarehouseItem* chainsawSkin; // Offset: 0x8

    // Skin to apply to combat shotgun
    idDeclWarehouseItem* combatShotgunSkin; // Offset: 0x10

    // Skin to apply to double barrel
    idDeclWarehouseItem* doubleBarrelSkin; // Offset: 0x18

    // Skin to apply to ballista
    idDeclWarehouseItem* ballistaSkin; // Offset: 0x20

    // Skin to apply to plasma
    idDeclWarehouseItem* plasmaSkin; // Offset: 0x28

    // Skin to apply to heavy cannon
    idDeclWarehouseItem* heavyCannonSkin; // Offset: 0x30

    // Skin to apply to rocket launcher
    idDeclWarehouseItem* rocketLauncherSkin; // Offset: 0x38

    // Skin to apply to chaingun
    idDeclWarehouseItem* chaingunSkin; // Offset: 0x40

}; // Size: 0x48
