struct weaponSlotLookup_t
{
    // idDeclWeapon for bfgSkin slot
    idDeclWeaponRef bfgSlot; // Offset: 0x0

    // idDeclWeapon for chainsawSkin slot
    idDeclWeaponRef chainsawSlot; // Offset: 0x8

    // idDeclWeapon for combatShotgunSkin slot
    idDeclWeaponRef combatShotgunSlot; // Offset: 0x10

    // idDeclWeapon for doubleBarrelSkin slot
    idDeclWeaponRef doubleBarrelSlot; // Offset: 0x18

    // idDeclWeapon for ballistaSkin slot
    idDeclWeaponRef ballistaSlot; // Offset: 0x20

    // idDeclWeapon for plasmaSkin slot
    idDeclWeaponRef plasmaSlot; // Offset: 0x28

    // idDeclWeapon for heavyCannonSkin slot
    idDeclWeaponRef heavyCannonSlot; // Offset: 0x30

    // idDeclWeapon for rocketLauncherSkin slot
    idDeclWeaponRef rocketLauncherSlot; // Offset: 0x38

    // idDeclWeapon for chaingunSkin slot
    idDeclWeaponRef chaingunSlot; // Offset: 0x40

}; // Size: 0x48
